<a href="https://colab.research.google.com/github/junheeyoon/Big-Data-analyst-Study/blob/master/Data_Scaling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#빅데이터 분석 기사 실기 스터디

#0. 환경 세팅

In [ ]:
import numpy as np
import pandas as pd
import sklearn
import tensorflow as tf

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

#1. 데이터 탐색

In [ ]:
# 현재 경로 확인
import os
print(os.path.abspath(os.curdir))

/content/drive/My Drive/데이터분석

In [ ]:
##########데이터 로드

#hour, attendance, score
df = pd.DataFrame([
    [2],
    [3],
    [3],
    [5],
    [7],
    [2],
    [8],
    [9],
    [6],
    [9],
    [6],
    [2]
], columns=['score'])

In [ ]:
df

    score
0       2
1       3
2       3
3       5
4       7
5       2
6       8
7       9
8       6
9       9
10      6
11      2

In [ ]:
a = np.reshape(df, -1)

In [ ]:
a

    score
0       2
1       3
2       3
3       5
4       7
5       2
6       8
7       9
8       6
9       9
10      6
11      2